app/Models/Autor.php

    public function verDados()
    {
        return $this->findAll();
---
SELECT *
FROM `autor`

    public function consultaID($id)
    {
        return $this->find($id);
---
SELECT *
FROM `autor`
WHERE `autor`.`id` = 2

    public function inserirDados($nome, $nacionalidade)
    {
        $this->insert(['nome' => $nome, 'nacionalidade' => $nacionalidade]);
---
INSERT INTO `autor` (`nome`, `nacionalidade`) VALUES ('Birilo', 'da Roca')

    public function ordenaAutor($campo,$tipoOdenacao)
    {
        return $this->orderBy($campo, $tipoOdenacao)->findAll();
---
SELECT *
FROM `autor`
ORDER BY `id` DESC

    public function consultaCondicao($nome)
    {
        return $this->where('nome', $nome)->findAll();
---
SELECT *
FROM `autor`
WHERE `nome` = 'George Orwell'