app/Models/Leitor.php

    public function verDados() {
        return $this->findAll();
---
SELECT *
FROM `leitor`

    public function consultaID($id) {
        return $this->find($id);
---
SELECT *
FROM `leitor`
WHERE `leitor`.`id` = 1

    public function inserirDados($nome, $email, $livro_id) {
        $this->insert([
            'nome' => $nome,
            'email' => $email,
            'livro_id' => $livro_id
        ]);
---
INSERT INTO `leitor` (`nome`, `email`, `livro_id`) VALUES ('Carlos Silva', 'carlos@gmail.com', 2)

    public function consultaCondicao($nome) {
        return $this->where('nome', $nome)->findAll();
---
SELECT *
FROM `leitor`
WHERE `nome` = 'João Souza'

    public function ordenaLeitor($campo, $tipoOrdenacao) {
        return $this->orderBy($campo, $tipoOrdenacao)->findAll();
---
SELECT *
FROM `leitor`
ORDER BY `id` DESC