app/Models/Livro.php

    public function verDados()
    {
        return $this->findAll();
---
SELECT *
FROM `livro`

    public function consultaID($id)
    {
        return $this->find($id);
---
SELECT *
FROM `livro`
WHERE `livro`.`id` = 1

    public function inserirDados($titulo, $ano_publicacao, $autor_id)
    {
        $this->insert([
            'titulo' => $titulo,
            'ano_publicacao' => $ano_publicacao,
            'autor_id' => $autor_id
        ]);
---
INSERT INTO `livro` (`titulo`, `ano_publicacao`, `autor_id`) VALUES ('O Pequeno Príncipe', 1943, 1)

    public function consultaCondicao($titulo)
    {
        return $this->where('titulo', $titulo)->findAll();
---
SELECT *
FROM `livro`
WHERE `titulo` = 'O Pequeno Príncipe'